# Free Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointIterator..::..Free Method
PointIterator Class See Also
---
Completes lifetime of the iterator. Call it when done using the iterator.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Free()
```

Visual Basic
---
```text
Public Sub Free
```

Visual C++
---
```text
public:
void Free()
```

# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace